docs/assign02.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-07-06 Tue 20:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SWE 619 Assignment 2</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ThanhVu (Vu) Nguyen" />
<link rel="stylesheet" href="https://nguyenthanhvuh.github.io/files/org.css">
</head>
<body>
<div id="content">
<h1 class="title">SWE 619 Assignment 2</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgdea0773">1. Goals: Contracts</a></li>
<li><a href="#org98e8d86">2. Grading Criteria</a></li>
<li><a href="#org7df38e9">3. Links</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgdea0773" class="outline-2">
<h2 id="orgdea0773"><span class="section-number-2">1</span> Goals: Contracts</h2>
<div class="outline-text-2" id="text-1">
<p>
For the second assignment, you'll build a <i>very</i> small piece of Java for a contract with preconditions, transform the contract so that all preconditions become postconditions, and then re-implement appropriately.
</p>

<p>
Consider a method that calculates the number of months needed to pay off a loan of a given size at a fixed <i>annual</i> interest rate and a fixed <i>monthly</i> payment. For instance, a $100,000 loan at an 8% annual rate would take 166 months to discharge at a monthly payment of $1,000, and 141 months to discharge at a monthly payment of $1,100. (In both of these cases, the final payment is smaller than the others; I rounded 165.34 up to 166 and 140.20 up to 141.) Continuing the example, the loan would never be paid off at a monthly payment of $100, since the principal would grow rather than shrink.
</p>

<p>
Define a Java class called <code>Loan</code>. In that class, write a method that satisfies the following specification:
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #b751b6;">@param</span> principal:  Amount of the initial principal
<span style="color: #b751b6;">@param</span> rate:       Annual interest rate  (8% rate expressed as rate = 0.08)
<span style="color: #b751b6;">@param</span> payment:    Amount of the monthly payment

<span style="color: #e45649;">public</span> <span style="color: #e45649;">static</span> <span style="color: #986801;">int</span> months (<span style="color: #986801;">int</span> <span style="color: #6a1868;">principal</span>, <span style="color: #986801;">double</span> <span style="color: #6a1868;">rate</span>, <span style="color: #986801;">int</span> <span style="color: #6a1868;">payment</span>)

Requires: principal, rate, and payment all positive 
         and payment is sufficiently large to drive the principal <span style="color: #986801;">to</span> <span style="color: #b751b6;">zero</span>.
<span style="color: #6a1868;">Effects</span>:  <span style="color: #e45649;">return</span> the number of months required to pay off the principal
</pre>
</div>


<p>
Note that the precondition is quite strong, which makes implementing the method easy. You should use double precision arithmetic internally, but the final result is an integer, not a floating point value. The key step in your calculation is to change the principal on each iteration with the following formula (which amounts to monthly compounding):
</p>

<div class="org-src-container">
<pre class="src src-java">newPrincipal = oldPrincipal * (1 + monthlyInterestRate) - payment;
</pre>
</div>


<p>
The variable names here are explanatory, not required. You may want to use different variables, which is fine.
</p>

<p>
<b>To make sure you understand the point about preconditions, your code is required to be minimal. Specifically, if it possible to delete parts of your implementation and still have it satisfy the requirements, you'll earn less than full credit.</b>
</p>

<p>
Now modify <code>months</code> so that it handles <b>all</b> of its preconditions with exceptions. Use the standard exceptions recommended by Bloch. Document this with a revised contract. You can use JavaDoc or you can simply identify the postconditions.
</p>
</div>
</div>


<div id="outline-container-org98e8d86" class="outline-2">
<h2 id="org98e8d86"><span class="section-number-2">2</span> Grading Criteria</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Adherence to instructions.</li>
<li>Minimal implementation.</li>
<li>Preconditions are correctly converted to exceptions.</li>
<li>Syntax: Java compiles and runs.</li>
</ul>
</div>
</div>

<div id="outline-container-org7df38e9" class="outline-2">
<h2 id="org7df38e9"><span class="section-number-2">3</span> Links</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><a href="./index.html">Syllabus</a></li>
<li><a href="./schedule.html">Schedule</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
